Repository: pingfangx/TranslatorX
Catalog: JetBrains/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: {0} Files
zh_cn: {0} 文件

source: {0} Info
zh_cn: {0} 信息

source: {0} Info (Canceled)
zh_cn: {0} 信息(已取消)

source: {0} License Expires Soon
zh_cn: {0} 许可证即将到期

source: {0} Modified without Checkout
zh_cn: {0} 已更改但没有检出

source: {0} Root
zh_cn: {0} 根

source: {0} To Import
zh_cn: {0} 导入

source: {0} already contains a {1}
zh_cn: {0} 已包含 {1}

source: {0} already contains field {1}
zh_cn: {0} 已包含字段 {1}

source: {0} already contains inner class named {1}
zh_cn: {0} 已包含名为 {1} 的内部类

source: {0} already exists in the target class.
zh_cn: {0} 已经存在于目标类中。

source: {0} already exists.
zh_cn: ''{0}'' 已经存在。

source: {0} already has a parameter named ''{1}''.
zh_cn: {0} 已经有一个名为 ''{1}'' 的参数。

source: {0} and {1, choice, 1#one more file|2#{1} more files}
zh_cn: {0} 和 {1} 个文件

source: {0} are not supported at language level ''{1}''
zh_cn: {0} 在语言级别 ''{1}'' 中不支持

source: {0} are not supported at this language level
zh_cn: 此语言级别不支持 {0}

source: {0} at position {1}
zh_cn: {0} 在位置 {1}

source: {0} browser path is not specified.
zh_cn: {0} 浏览器的路径未指定。

source: {0} cannot be enabled for the project because {1, choice, 1#its library isn''t|2#their libraries aren''t} configured.
zh_cn: 无法为项目启用 {0} ，因为{1, choice, 1#它|2#它们} 的库未配置。

source: {0} cannot be loaded.
zh_cn: {0} 无法加载。

source: {0} cannot be placed under {1}
zh_cn: {0} 无法放在 {1} 之下

source: {0} carets
zh_cn: {0} 插入符

source: {0} changed {0,choice,1#file|2#files}
zh_cn: {0} 个更改的文件

source: {0} class initializer
zh_cn: {0} 类初始化器

source: {0} code style scheme was exported to {1}
zh_cn: {0} 代码样式方案已导出到 {1}

source: {0} code {0, choice, 1#duplicate|2#duplicates} found
zh_cn: 发现 {0} 代码重复

source: {0} completed successfully.
zh_cn: {0} 已成功完成。

source: {0} contains call with null argument for parameter {1}
zh_cn: {0} 包含参数 {1} 的 null 参数调用

source: {0} contains read-only file(s).
zh_cn: {0} 包含只读文件。

source: {0} context configuration
zh_cn: {0} 上下文配置

source: {0} copy
zh_cn: {0} 复制

source: {0} copy {1}
zh_cn: {0} 复制 {1}

source: {0} days
zh_cn: {0} 天

source: {0} days left
zh_cn: 剩余 {0} 天

source: {0} deleted {0,choice,1#file|2#files}
zh_cn: {0} 个删除文件

source: {0} does not appear to be {1} config folder or installation home
zh_cn: {0} 似乎没有 {1} 配置文件夹或安装目录

source: {0} does not exist.
zh_cn: ''{0}'' 不存在。

source: {0} does not have base classes/interfaces in current project
zh_cn: {0} 在当前项目中没有基类/接口

source: {0} does not have write access to {1}.
zh_cn: {0} 没有 {1} 的写入权限。

source: {0} duplicates
zh_cn: {0} 重复

source: {0} duplicates, Cost: {1} in {2}
zh_cn: {0} 重复, Cost: {1} in {2}

source: {0} duplicates, Cost: {1} in {2} files
zh_cn: {0} 重复, Cost: {1} in {2} files

source: {0} elements
zh_cn: {0} 元素

source: {0} exit {0, choice, 1#point|2#points} highlighted (press {1} again to remove the highlighting, Escape to remove all highlighting)
zh_cn: {0} 个退出点高亮 (再按 {1} 移除高亮，按 Esc 移除所有高亮)

source: {0} expected
zh_cn: {0} 是预期的

source: {0} facet must be placed under {1} facet
zh_cn: {0} facet 必须放在 {1} facet 下面

source: {0} facets are not allowed in {1}
zh_cn: {0} facets 在 {1} 中不允许

source: {0} failed to convert existing regular expression patterns: {1} Please enter pattern string in a new format.
zh_cn: {0} 无法转换现有的正则表达式模式: {1} 请输入新格式的模式。

source: {0} file
zh_cn: {0} 文件

source: {0} file &location:
zh_cn: {0} 文件位置:(&L)

source: {0} file will be stored in this directory
zh_cn: {0} 文件将存储在此目录中

source: {0} file(s)
zh_cn: {0} 文件

source: {0} files processed in ''{1}''.
zh_cn: {0} 处理于 ''{1}''。

source: {0} folder already exists in {1}.
zh_cn: {0} 文件夹已存在于 {1} 中。

source: {0} has an implementation but <ul><li>it is never instantiated OR</li><li>no instantiations are reachable from entry points.</li></ul>
zh_cn: {0} 有一个实现但 <ul><li>它从未实例化，或</li><li>没有实例化从入口点是可达。</li></ul>

source: {0} has detected {1} code {1,choice,1#fragment|2#fragments} in this class that can be replaced using newly created Set.
zh_cn: {0} 检测到这个类中的 {1} 个代码片断可以替换为新的创建集。

source: {0} has detected {1} code {1,choice,1#fragment|2#fragments} in this file that can be replaced with a call to extracted method.
zh_cn: {0} 在这个文件中检测到 {1} 个代码片断可以替换为提取的方法的调用。

source: {0} has found fragments that can be replaced with include directive Do you want to review them?
zh_cn: {0} 找到了可以用 include 指令替换的片段 你想检查他们吗?

source: {0} has not found any duplicates
zh_cn: {0} 没有发现任何重复

source: {0} has {1, choice, 1#direct or indirect implementation|2#{1,number} direct or indirect implementations} but <ul><li>—they are never instantiated OR</li><li>—no instantiations are reachable from entry points.</li></ul>
zh_cn: {0} 有 {1, choice, 1#1 个|2#{1,number} 个} 直接或间接实现，但 <ul><li>—它们从未实例化，或</li><li>—没有实例化从入口点是可达的。</li></ul>

source: {0} has {1,choice,1#1 usage that is|2#{1,number} usages that are} not safe to delete.
zh_cn: {0} 有 {1} 个使用，删除不安全。

source: {0} home path:
zh_cn: {0} 主路径:

source: {0} implements {1}.
zh_cn: {0} 实现 {1}。

source: {0} import failed with error message: {1}
zh_cn: {0} 导入失败,错误信息:{1}

source: {0} in XML descriptor
zh_cn: {0} 在 XML 描述符中

source: {0} in class {1}
zh_cn: {0} 在类 {1}

source: {0} in interface {1}
zh_cn: {0} 在接口 {1}

source: {0} in {1}
zh_cn: {1} 中的 {0}

source: {0} incoming changelists available
zh_cn: {0} 传入更自以为是列表可用

source: {0} is a part of method hierarchy.
zh_cn: {0} 是方法层次结构的一部分。

source: {0} is a project file.
zh_cn: {0} 是一个项目文件。

source: {0} is abstract.
zh_cn: {0} 是抽象的。

source: {0} is already overridden in {1}.
zh_cn: {0} 已在 {1} 中重写。

source: {0} is an interface that has no implementing classes
zh_cn: {0} 是没有实现类的接口

source: {0} is an interface.
zh_cn: {0} 是一个接口。

source: {0} is currently searching for frameworks.
zh_cn: {0} 目前正在搜索框架。

source: {0} is currently searching for sources.
zh_cn: {0} 正在搜索源码。

source: {0} is directory
zh_cn: {0} 是目录

source: {0} is located in a read-only container.
zh_cn: {0} 位于只读容器中。

source: {0} is missing after @{1} tag
zh_cn: @{1} 标签后缺少 {0}

source: {0} is modified in loop body
zh_cn: {0} 在循环体中被修改

source: {0} is not a directory!
zh_cn: {0} 不是一个目录!

source: {0} is not accessible from {1}.
zh_cn: {0} 无法从 {1} 中访问。

source: {0} is not declared to be thrown by method {1}
zh_cn: {0} 未被声明为方法 {1} 抛出

source: {0} is not implemented.
zh_cn: {0} 未实现。

source: {0} is not initialized in declaration.
zh_cn: {0} 在声明中未初始化。

source: {0} is not static.
zh_cn: {0} 不是静态的。

source: {0} is not supported for {1}
zh_cn: {0} 不支持 {1}

source: {0} is not supported in current context
zh_cn: {0} 在当前上下文不支持

source: {0} is read-only.
zh_cn: {0} 是只读的。

source: {0} is ready to <a href="update">update</a>.
zh_cn: {0} 已准备好 <a href="update">更新</a>.

source: {0} is used for writing in {1}
zh_cn: {0} 用于写入在 {1}

source: {0} is {1} and will not be accessible from {2}.
zh_cn: {0} 是 {1} 无法从 {2} 访问。

source: {0} isn''t a directory
zh_cn: {0} 不是一个目录

source: {0} isn''t inheritor of TestCase
zh_cn: {0} 不是 Test Case 的继承者

source: {0} isn''t test class
zh_cn: {0} 不是测试类

source: {0} items more (irrelevant)...
zh_cn: {0} 项更多(不相关)...

source: {0} level library <b>{1}</b> with {2} {2, choice, 1#file|2#files} will be created
zh_cn: {0} 级别库 <b>{1}</b> 与 {2} 个文件将被创建

source: {0} library
zh_cn: {0} 库

source: {0} library not found in the module
zh_cn: {0} 库在该模块中未找到

source: {0} line {0,choice,1#break|2#breaks}
zh_cn: {0} 行 {0,choice,1#break|2#breaks}

source: {0} location path should be absolute
zh_cn: {0} 位置路径应该是绝对的

source: {0} matching pattern
zh_cn: {0} 匹配模式

source: {0} megabytes
zh_cn: {0} 兆字节

source: {0} missing though required
zh_cn: {0} 缺少所要的

source: {0} name
zh_cn: {0} 名字

source: {0} name <code>#ref</code> doesn''t match regex ''{1}'' #loc
zh_cn: {0} 名 <code>#ref</code> 不匹配正则 ''{1}'' #loc

source: {0} name <code>#ref</code> is too long ({1} > {2}) #loc
zh_cn: {0} 名 <code>#ref</code> 太长 ({1} > {2}) #loc

source: {0} name <code>#ref</code> is too long ({1} \&gt; {2}) #loc
zh_cn: {0} 名 <code>#ref</code> 太长 ({1} \&gt; {2}) #loc

source: {0} name <code>#ref</code> is too short ({1} < {2}) #loc
zh_cn: {0} 名 <code>#ref</code> 太短 ({1} < {2}) #loc

source: {0} name <code>#ref</code> is too short ({1} \&lt; {2}) #loc
zh_cn: {0} 名 <code>#ref</code> 太短 ({1} \&lt; {2}) #loc

source: {0} needs too much resources to perform requested operation.
zh_cn: {0} 需要太多资源来执行请求操作。

source: {0} new {0,choice,1#file|2#files}
zh_cn: {0} 个新文件

source: {0} not found
zh_cn: {0} 未找到

source: {0} of annotation type {1}
zh_cn: 注解类型 {1} 的 {0}

source: {0} of anonymous class
zh_cn: 匿名类的 {0}

source: {0} of class {1}
zh_cn: 类 {1} 的 {0}

source: {0} of enum {1}
zh_cn: 枚举 {1} 的 {0}

source: {0} of interface {1}
zh_cn: 接口 {1} 的 {0}

source: {0} of {1} Failed: {2}
zh_cn: {0} / {1} 失败: {2}

source: {0} of {1} in {2}
zh_cn: {0} / {1} 在 {2} 中

source: {0} overridden {0, choice, 1#method|2#methods} found (press {1} again to remove the highlighting, Escape to remove all highlighting)
zh_cn: 找到 {0} 个重写方法 (再按 {1} 移除高亮，按 Esc 移除所有高亮)

source: {0} refactoring cannot be applied to abstract methods
zh_cn: {0} 重构无法应用于抽象方法

source: {0} refactoring cannot be applied to constructors
zh_cn: {0} 重构不能应用于构造器

source: {0} refactoring cannot be applied to inline non-chaining constructors
zh_cn: {0} 重构不能用于内联非链接构造函数

source: {0} refactoring cannot be applied to vararg constructors
zh_cn: {0} 重构不能用于可变参数的构造器

source: {0} refactoring cannot be applied: no sources attached
zh_cn: {0} 重构无法应用:没有附加源码

source: {0} refactoring is not supported for JSP
zh_cn: {0} 重构不支持 JSP

source: {0} refactoring is not supported for package-info.java
zh_cn: package -info.java 不支持 {0} 重构

source: {0} refactoring is not supported in the current context
zh_cn: {0} 重构在当前上下文不支持

source: {0} refactoring is not supported when return statement interrupts the execution flow
zh_cn: 当 return 语句中断执行流时，不支持 {0} 重构

source: {0} refactoring is supported only for final fields
zh_cn: {0} 重构仅支持 final 字段

source: {0} refactoring may not be applied to remove recursive methods.
zh_cn: {0} 重构可能不适用于移除递归方法。

source: {0} scope
zh_cn: {0} 范围

source: {0} settings were imported to {1} scheme.{2}
zh_cn: {0} 设置将要导入到 {1} 方案中。{2}

source: {0} should have fixed value {1}
zh_cn: {0} 应具有固定值 {1}

source: {0} tag description is missing
zh_cn: {0} 标签描述缺少

source: {0} test case(s)
zh_cn: {0} 的测试实例

source: {0} that is used in inlined method is not accessible from call site(s) in {1}
zh_cn: {1} 中的调用站点无法访问内联方法中使用的 {0}

source: {0} the whole &project
zh_cn: {0} 整个项目(&P)

source: {0} to be made static
zh_cn: {0} 要被静态化

source: {0} to be moved to {1}
zh_cn: {0} 被移动到 {1}

source: {0} to be renamed to {1}{2}
zh_cn: {0} 重新命名为 {1}{2}

source: {0} to change signature
zh_cn: {0} 以更改签名

source: {0} to invert
zh_cn: {0} 反转

source: {0} type not selected
zh_cn: {0} 类型未选择

source: {0} upcasts an instance of {1} to {2}
zh_cn: {0} 向上转 {1} 的一个实例为 {2}

source: {0} uptime: {1}
zh_cn: {0} 运行时间: {1}

source: {0} uses non-static {1}, which is not passed as a parameter
zh_cn: {0} 使用非静态 {1} ,它不是作为一个参数传递

source: {0} uses package-private {1}
zh_cn: {0} 使用包私有 {1}

source: {0} uses {1} of an instance of a {2}
zh_cn: {0} 使用 {2} 的一个实例 {1}

source: {0} uses {1}, which is not accessible from the superclass
zh_cn: {0} 使用 {1},这从超类是不可访问的

source: {0} uses {1}, which is not moved to the superclass
zh_cn: {0} 使用 {1},没有移动到超类

source: {0} uses {1}, which is pushed down
zh_cn: {0} 使用 {1}，它被按下

source: {0} uses {1}, which needs class instance
zh_cn: {0} 使用 {1} ，它需要类实例

source: {0} vs Editor
zh_cn: {0}vs 编辑器

source: {0} vs {1}
zh_cn: {0} 与 {1}

source: {0} was imported to {1} scheme.
zh_cn: {0} 已导入 {1} 方案。

source: {0} will be inaccessible from {1}
zh_cn: {0} 将无法从 {1} 访问

source: {0} will become inaccessible from {1}
zh_cn: {0} 将无法从 {1} 访问

source: {0} will hide renamed {1}
zh_cn: {0} 将隐藏重名为 {1}

source: {0} will no longer be accessible from {1}
zh_cn: {0} 将无法从 {1} 访问

source: {0} will no longer override {1}
zh_cn: {0} 将不再重写 {1}

source: {0} will not be accessible from {1} after inlining
zh_cn: 内联后 {0} 将无法从 {1} 访问

source: {0} will now exit.
zh_cn: {0} 现在将退出。

source: {0} will override renamed {1}
zh_cn: {0} 将覆盖重命名为 {1}

source: {0} will unlock them.<br>{1}</body></html>
zh_cn: {0} 将将解锁他们。<br>{1}</body></html>

source: {0} will use this data to automatically replace module names in workspace settings when other team members update the project from VCS.
zh_cn: 当其他团队成员从 VCS 更新项目时，{0} 将使用此数据自动替换工作区设置中的模块名称。

source: {0} with name ''{1}'' already exists
zh_cn: 名称为 ''{1}'' 的 {0} 已经存在

source: {0} with such name already exists
zh_cn: 名称 {0} 已经存在

source: {0} with such name already exists in file ''{1}''
zh_cn: {0} 该名称已经存在于文件 ''{1}''

source: {0} with {1} visibility won''t be accessible from {2}
zh_cn: {1} 可见性的 {0} 无法从 {2} 访问

source: {0} {0, choice, 1#usage|2#usages} found (press {2} again to remove the highlighting, Escape to remove all highlighting)
zh_cn: 找到 {0} 个使用 (再按 {2} 移除高亮，按 Esc 移除所有高亮)

source: {0} {0, choice, 1#usage|2#usages} of {1} found (press {2} again to remove the highlighting, Escape to remove all highlighting)
zh_cn: 找到 {1} 的 {0} 个使用 (再按 {2} 移除高亮，按 Esc 移除所有高亮)

source: {0} {0,choice, 0#errors|1#error|2#errors}
zh_cn: {0} {0,choice, 0#个错误|1#个错误|2#个错误}

source: {0} {0,choice, 0#warnings|1#warning|2#warnings}
zh_cn: {0} {0,choice, 0#个警告|1#个警告|2#个警告}

source: {0} {1, choice, 1#framework is|2#frameworks are} detected in the project <a href="configure">Configure</a>
zh_cn: {0} 个框架检测到在项目 <a href="configure">配置</a>中

source: {0} {1, choice, 1#framework is|2#frameworks are} detected.
zh_cn: {0} 个框架检测到。

source: {0} {1} found so far.
zh_cn: 目前找到 {0} {1} 。

source: {0} {1} to activate changes in plugins?
zh_cn: {0} {1} 激活插件中的更改?

source: {0} {1} to reload the settings?
zh_cn: {0} {1} 以重新加载配置？

source: {0} {1} was exported to {2}
zh_cn: {0} {1} 导出到 {2}

source: {0}"{1}" does not exist.
zh_cn: {0}"{1}" 不存在。

source: {0}() in {1}
zh_cn: {1} 中的 {0}()

source: {0}, line {1}
zh_cn: {0}, 行 {1}

source: {0}, perform "Find Next" again to search from the top
zh_cn: {0}, 再次执行 "查找下一个" 以从顶部进行搜索

source: {0}, perform "Find Previous" again to search from the bottom
zh_cn: {0}, 再次执行 "查找上一个" 以从底部进行搜索

source: {0}, press {1} to search from the bottom
zh_cn: {0},按下 {1} 从底部搜索

source: {0}, press {1} to search from the top
zh_cn: {0},按下 {1} 从顶部搜索

source: {0}, referenced in {1}, will not be accessible from module {2}
zh_cn: {1} 中引用的 {0} 将无法从模块 {2} 访问

source: {0}, referenced in {1}, will not be accessible from the production sources of module {2}
zh_cn: 在 {1} 中引用的 {0} 将无法从模块 {2} 的生产源码中访问

source: {0}, referenced in {1}, will not be accessible in module {2}
zh_cn: 在 {1} 中引用的 {0} 将不能在模块 {2} 中访问

source: {0}.{1} will be accessed at {2}({3}:{4,number,#})
zh_cn: {0}.{1} 将在 {2}({3}:{4,number,#}) 访问

source: {0}.{1} will be modified at {4}({5}:{6,number,#}).
zh_cn: {0}.{1} 将在 {4}({5}:{6,number,#}) 修改。

source: {0}: Get Version {1}
zh_cn: {0}: 获取版本 {1}

source: {0}: Local Changes Refresh
zh_cn: {0}:本地更改刷新

source: {0}; attempting to assign weaker access privileges (''{1}''); was ''{2}''
zh_cn: {0}; 尝试分配较弱的访问权限(''{1}'');是 ''{2}''

source: {0}; both methods have same erasure
zh_cn: {0}; 两种方法都有相同的 erasure

source: {0}; both methods have same erasure, yet neither hides the other
zh_cn: {0};两种方法都有相同的 erasure，但也不会隐藏另一个方法

source: {0}; both methods have same erasure, yet neither overrides the other
zh_cn: {0};两种方法都有相同的 erasure，但也不会覆盖另一个方法

source: {0}; overridden method does not throw ''{1}''
zh_cn: {0}; 重写方法没有抛出 ''{1}''

source: {0}Button{1} Click
zh_cn: {0} 按钮 {1} 单击

source: {0}Button{1} Double-Click
zh_cn: {0} 按钮 {1} 双击

source: {0}Wheel down
zh_cn: {0} 滚轮向下

source: {0}Wheel up
zh_cn: {0} 滚轮向上

source: {0}class initializer
zh_cn: {0} 类初始化器

source: {1, choice, 0#No conflicts|1#One conflict|2#{0, number} conflicts}
zh_cn: {1, choice, 0#无冲突|1#1 冲突|2#{0, number} 冲突}

source: {1, choice, 1#Module ''''{2}'''' depends|2#{1} modules depend} on the selected {0, choice, 1#module|2#modules}.
zh_cn: {1, choice, 1#模块 ''''{2}'''' |2#{1} 个模块}依赖于所选模块。

source: {1} may become unresponsive or even fail with OutOfMemoryError if you continue.
zh_cn: 如果继续，{1} 可能会变得反应缓慢，甚至因内存不足而失败。

source: {1} refactoring is supported for static members only.
zh_cn: {1} 重构只支持静态成员。

source: {1} the getter as well?
zh_cn: 也 {1} getter?

source: {1} the setter as well?
zh_cn: 也 {1} setter ?

source: {1} them as well?
zh_cn: 也 {1} 它们?

source: {1} will automatically convert it to the new format.
zh_cn: {1} 将自动将其转换为新格式。

source: {4}<br/><br/>Current version is {3}.<br/>Modified by {0}<br/>{1}<br/>{2}
zh_cn: {4}<br/><br/>当前版本是 {3}.<br/>由 {0} 修改<br/>{1}<br/>{2}

source: — defined in the color scheme
zh_cn: — 定义于颜色方案

source: … (Double-click to see more items)
zh_cn: …(双击查看更多项)

source: … (length: {0})
zh_cn: … (长度: {0})

source: … ({0} more {0, choice, 1#item|2#items}.
zh_cn: … ({0} 更多项。

source: … Evaluate
zh_cn: … 计算

source: … Navigate
zh_cn: … 导航

source: … Show icon
zh_cn: … 显示图标

source: … Show image
zh_cn: … 显示图像

source: … View
zh_cn: … 查看
